:PROPERTIES:
:ID:       5a91c3ff-9f34-4294-9a56-b89a51acf563
:END:
#+TITLE:     Ectorepo: x.files
#+AUTHOR:    David Conner
#+EMAIL:     noreply@te.xel.io

*** IDEA Use [[https://github.com/magit/orgit][magit/orgit's orgit-rev]] for links to code in the repo

* Inbox

* Dotfiles

** Shell

***** TODO look at [[man][Haozeke/dotfiles/dotfiles/common]]
+ [ ] particularly =.shellrc= and =.direnvrc.=
+ [ ] search HaoZeke for =.bashPlatform= and =.bashSpecifics=
+ [ ] search for =common/=

* Emacs

** Input

** Completion

** UI

** Editor

** Term
***** TODO find configs using things like =shell-command-on-region=

** Checkers

** Tools

** OS

** Lang

** App
*** eww
*** mu4e
*** erc

** Config

** Hydras

* Doom

* Chemacs

* Elisp

* Org

** Journal
** Roam
** Capture
** Refile
** Agenda
** Clock
** Super Agenda
*** org-ql
*** org-sidebar
** Flashcards

* Babel

+ dfeich/org-babel-examples

* Insights

** Structure

*** Bash

**** Organization of sourced =*.sh= scripts

Likely sourced

#+begin_src shell :results output verbatim :var xdotfiles=(expand-file-name "x.files" dc/ecto-path)
locate "$xdotfiles/*/dotfiles/*.sh" |\
    sed -E "s/^.*$(basename $xdotfiles)//g" |\
    tree --fromfile . -d
#+end_src

#+RESULTS:
#+begin_example
.
├── abougouffa
│   └── dotfiles
├── akagi
│   └── dotfiles
│       └── etc
│           └── polybar
├── ambrevar
│   └── dotfiles
├── bamos
│   └── dotfiles
├── benmezger
│   └── dotfiles
│       └── chezmoi
│           ├── dot_bin
│           │   └── helpers
│           └── dot_config
│               └── i3
│                   └── scripts
├── blejdfist2
│   └── dotfiles
├── cjbassi
│   └── dotfiles
│       ├── installation
│       └── shell
├── daviwil
│   └── dotfiles
├── dcunited001
│   └── dotfiles
│       ├── bin
│       └── gh
│           └── bash
│               └── rc
├── DiamondBond
│   └── dotfiles
│       ├── etc
│       │   └── profile.d
│       └── legacy
│           ├── infinality
│           ├── tint2
│           │   └── PILLS
│           └── vim
├── dpgraham4401
│   └── dotfiles
│       └── configs
├── dwt1
│   └── dotfiles
├── engstrand-config
│   └── dotfiles
├── geolessel
│   └── dotfiles
│       └── bin
├── gtrunsec
│   └── dotfiles
│       ├── pkgs
│       │   └── my-node-packages
│       └── users
├── HaoZeke
│   └── dotfiles
│       ├── dot_config
│       │   └── shellrc
│       │       └── posix.d
│       └── dot_local
│           └── bin
├── hlissner
│   └── dotfiles
│       ├── bin
│       ├── config
│       │   ├── hypr
│       │   │   └── bin
│       │   └── rofi
│       │       └── bin
│       └── modules
│           └── themes
│               └── autumnal
│                   └── config
│                       └── polybar
├── ifreund
│   └── dotfiles
│       ├── config
│       │   └── waybar
│       └── local
│           └── bin
├── isti115
│   └── dotfiles
├── jgkamat
│   └── dotfiles
│       ├── kitty
│       ├── qutebrowser
│       ├── ranger
│       ├── retired
│       ├── script
│       └── tablet
├── Jorengarenar
│   └── dotfiles
│       ├── bin
│       ├── config
│       │   ├── polybar
│       │   ├── profile.d
│       │   ├── sh
│       │   ├── tmux
│       │   └── vale
│       └── extern
├── kitnil
│   └── dotfiles
│       ├── apps
│       │   └── base
│       │       └── znc
│       │           └── rootfs
│       │               └── usr
│       │                   └── local
│       │                       └── bin
│       ├── cilium
│       │   └── tls
│       │       └── generated
│       ├── dotfiles
│       │   ├── docker
│       │   │   ├── archlinux
│       │   │   ├── archlinux-builder
│       │   │   ├── debian
│       │   │   ├── gentoo
│       │   │   ├── guix
│       │   │   ├── guix-workstation
│       │   │   ├── kali-rolling
│       │   │   ├── nixos
│       │   │   ├── nixos-container-systemd
│       │   │   ├── paws
│       │   │   └── ubuntu
│       │   ├── firefox
│       │   ├── guixsd
│       │   │   └── scripts
│       │   ├── jenkins
│       │   ├── nix
│       │   ├── run
│       │   │   ├── guixsd
│       │   │   ├── guix-workstation
│       │   │   ├── notebook
│       │   │   └── pc0
│       │   ├── scripts
│       │   └── windows
│       │       └── winrm
│       │           └── bash
│       ├── dot_local
│       │   └── bin
│       ├── dot_tmuxifier-layouts
│       ├── etc
│       ├── infrastructure
│       │   └── base
│       │       ├── cilium
│       │       ├── opensearch
│       │       │   └── scripts
│       │       └── powerdns
│       └── src
│           └── go
│               └── workstation-controller
├── Nekoyuki
│   └── dotfiles
│       └── kaoriya-vim
├── oriansj
│   └── dotfiles
│       └── files
├── protesilaos
│   └── dotfiles
│       ├── dunst
│       ├── gnome
│       ├── mbsync
│       ├── scripts
│       ├── wayland
│       ├── xorg
│       └── xorg-twm
├── sistematico
│   └── dotfiles
│       ├── base
│       │   └── usr
│       │       └── local
│       │           └── bin
│       ├── docker
│       │   └── docker
│       │       └── scripts
│       ├── firefox
│       │   └── firefox-gnome-theme
│       │       └── scripts
│       ├── gnome
│       │   └── bin
│       ├── home
│       │   ├── bin
│       │   └── modelos
│       ├── i3
│       │   └── bin
│       ├── lightdm
│       │   └── usr
│       │       └── local
│       │           └── bin
│       ├── mate
│       │   └── bin
│       ├── polybar
│       ├── unbound
│       │   ├── bin
│       │   └── usr
│       │       └── local
│       │           └── bin
│       └── xfce
│           └── bin
├── SqrtMinusOne
│   └── dotfiles
│       └── bin
│           └── polybar
├── thiagowfx
│   └── dotfiles
│       ├── git
│       ├── profile
│       └── ssh_auto_tmux
├── ubolonton
│   └── dotfiles
├── whitelynx
│   └── dotfiles
│       └── dotfiles
│           └── config
│               ├── sketchybar
│               │   └── plugins
│               ├── sway
│               │   └── scripts
│               └── waybar
│                   └── scripts
└── xenodium
    └── dotfiles
        └── emacs

227 directories
#+end_example
